#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_cloudfront_function.routing_handler: Refreshing state... [id=routing_handler]
aws_s3_bucket.plancraftr_com: Refreshing state... [id=plancraftr.com]
aws_security_group.live_server_plancraftr_sg: Refreshing state... [id=sg-08ce07cc0e7c1f5f9]
aws_s3_bucket.www_plancraftr_com: Refreshing state... [id=www.plancraftr.com]
aws_instance.live_server_plancraftr: Refreshing state... [id=i-0d557888cadf6fbcb]
aws_s3_bucket_public_access_block.allow_public_access_s3_www: Refreshing state... [id=www.plancraftr.com]
aws_s3_bucket_website_configuration.static_website_config_s3_www: Refreshing state... [id=www.plancraftr.com]
aws_cloudfront_distribution.www_distribution: Refreshing state... [id=E1X0NW6OPOT0BP]
aws_route53_record.live_api_plancraftr: Refreshing state... [id=Z097947118UN4SFV6P8TX_live.api.plancraftr.com_A]
aws_s3_bucket_public_access_block.allow_public_access_s3: Refreshing state... [id=plancraftr.com]
aws_s3_bucket_website_configuration.static_website_config_s3: Refreshing state... [id=plancraftr.com]
aws_route53_record.www_plancraftr: Refreshing state... [id=Z097947118UN4SFV6P8TX_www.plancraftr.com_A]
aws_s3_bucket_policy.allow_anyone_get_objects_s3: Refreshing state... [id=plancraftr.com]
aws_s3_bucket_policy.allow_anyone_get_objects_s3_www: Refreshing state... [id=www.plancraftr.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_cloudfront_distribution.www_distribution has been deleted
  - resource "aws_cloudfront_distribution" "www_distribution" {
      - domain_name                    = "d2xigkjj2kwne4.cloudfront.net" -> null
      - hosted_zone_id                 = "Z2FDTNDATAQYW2" -> null
        id                             = "E1X0NW6OPOT0BP"
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.distribution will be created
  + resource "aws_cloudfront_distribution" "distribution" {
      + aliases                         = [
          + "plancraftr.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "s3_origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "plancraftr.com.s3.ap-southeast-1.amazonaws.com"
          + origin_id           = "s3_origin"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:084828604403:certificate/243b8f73-9d67-4956-9f89-df37c6ad54f9"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_distribution.www_distribution will be created
  + resource "aws_cloudfront_distribution" "www_distribution" {
      + aliases                         = [
          + "www.plancraftr.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "www_s3_origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = "arn:aws:cloudfront::084828604403:function/routing_handler"
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "www.plancraftr.com.s3.ap-southeast-1.amazonaws.com"
          + origin_id           = "www_s3_origin"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:084828604403:certificate/243b8f73-9d67-4956-9f89-df37c6ad54f9"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_route53_record.plancraftr will be created
  + resource "aws_route53_record" "plancraftr" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "plancraftr.com"
      + type            = "A"
      + zone_id         = "Z097947118UN4SFV6P8TX"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.www_plancraftr will be created
  + resource "aws_route53_record" "www_plancraftr" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.plancraftr.com"
      + type            = "A"
      + zone_id         = "Z097947118UN4SFV6P8TX"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @hasangawr, Action: `pull_request`*